---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertexArray.GetEnumerator
source: html/138e7fcf-972f-a200-2223-897b86c26052.htm
---
# Autodesk.Revit.DB.SlabShapeVertexArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.